# Step. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

# Step. Create 3 differents Series, each of length 100, as follows:

<br>

The first a random number from 1 to 4<br>
The second a random number from 1 to 3<br>
The third a random number from 10,000 to 30,000

In [16]:
first = pd.Series(np.random.randint(1, 4, 100))
second = pd.Series(np.random.randint(1, 3, 100))
third = pd.Series(np.random.randint(10000, 30000, 100))

In [17]:
first.head()

0    1
1    1
2    3
3    2
4    2
dtype: int32

In [18]:
second.head()

0    2
1    1
2    2
3    1
4    1
dtype: int32

In [19]:
third.head()

0    19028
1    13586
2    29505
3    19525
4    12774
dtype: int32

# Step. Let's create a DataFrame by joinning the Series by column

In [28]:
df = pd.concat([first, second, third], axis=1)
df.head()

   0  1      2
0  1  2  19028
1  1  1  13586
2  3  2  29505
3  2  1  19525
4  2  1  12774

# Step. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [29]:
df.rename(columns ={0:'bedrs', 1:'bathrs', 2:'price_sqr_meter'}, inplace=True)
df.head()

   bedrs  bathrs  price_sqr_meter
0      1       2            19028
1      1       1            13586
2      3       2            29505
3      2       1            19525
4      2       1            12774

# Step. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [39]:
bigcolumn = pd.concat([first, second, third])
bigcolumn = bigcolumn.to_frame()
print(type(bigcolumn))
bigcolumn.head()

<class 'pandas.core.frame.DataFrame'>

   0
0  1
1  1
2  3
3  2
4  2

# Step. Ops it seems it is going only until index 99. Is it true?

In [40]:
bigcolumn.tail()

        0
95  24925
96  21401
97  14834
98  15903
99  17223

# Step. Reindex the DataFrame so it goes from 0 to 299

In [44]:
bigcolumn = bigcolumn.reset_index()
bigcolumn.tail()

     index      0
295     95  24925
296     96  21401
297     97  14834
298     98  15903
299     99  17223